<?php
// Здесь описываем все те функции, которые больше негде описать

class clCommon {
	//======================================================================
	// Конструктор
	public function __construct() {
	}
	//======================================================================
	
	//======================================================================
	// Получение пути к шаблону
	public function GetTemplatePath($tpl) {
		$rv = dirname(__FILE__) . '/../templates/' . $tpl . '.tpl';
		return $rv;
	}
	//======================================================================
	
	//======================================================================
        // Функция для нормализации чисел
        // Написана в связи с проблемами у intval на 32-битных системах
	public function IntValue($val) {
		$val = preg_replace('{[^\d]+}ui', '', $val);
		if ($val == '') $val = 0;
		return $val;
	}
        //======================================================================
}
